In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('1973-UC-Berkeley-Admission-Data-Synthesis-Data.csv')

In [6]:
df

  Department  Male-Admitted  Male-Denied  Female-Admitted  Female-Denied
0          A            512          313               89             19
1          B            313          207               17              8
2          C            101          205              202            391
3          D            138          279              131            244
4          E             40          138               94            299
5          F             22          351               24            317

In [9]:
a = df['Male-Admitted']
b = df['Male-Denied']
a + b

0    825
1    520
2    306
3    417
4    178
5    373
dtype: int64

In [10]:
df['Male-Admitted'] / (df['Male-Admitted'] + df['Male-Denied'])

0    0.620606
1    0.601923
2    0.330065
3    0.330935
4    0.224719
5    0.058981
dtype: float64

In [12]:
df['Male-Ratio'] = df['Male-Admitted'] / (df['Male-Admitted'] + df['Male-Denied'])

In [13]:
df

,Department,Male-Admitted,Male-Denied,Female-Admitted,Female-Denied,Male-Ratio
0,A,512,313,89,19,0.620606
1,B,313,207,17,8,0.601923
2,C,101,205,202,391,0.330065
3,D,138,279,131,244,0.330935
4,E,40,138,94,299,0.224719
5,F,22,351,24,317,0.058981

In [14]:
df['Female-Ratio'] = df['Female-Admitted'] / (df['Female-Admitted'] + df['Female-Denied'])

In [15]:
df

,Department,Male-Admitted,Male-Denied,Female-Admitted,Female-Denied,Male-Ratio,Female-Ratio
0,A,512,313,89,19,0.620606,0.824074
1,B,313,207,17,8,0.601923,0.680000
2,C,101,205,202,391,0.330065,0.340641
3,D,138,279,131,244,0.330935,0.349333
4,E,40,138,94,299,0.224719,0.239186
5,F,22,351,24,317,0.058981,0.070381

In [16]:
df['Male-Ratio']

0    0.620606
1    0.601923
2    0.330065
3    0.330935
4    0.224719
5    0.058981
Name: Male-Ratio, dtype: float64

In [21]:
(df['Female-Ratio'] > df['Male-Ratio']).sum()

6

In [22]:
(df['Female-Ratio'] > df['Male-Ratio'])

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [23]:
df = pd.read_csv('1973-UC-Berkeley-Admission-Data-Synthesis-Data.csv')

In [24]:
df

  Department  Male-Admitted  Male-Denied  Female-Admitted  Female-Denied
0          A            512          313               89             19
1          B            313          207               17              8
2          C            101          205              202            391
3          D            138          279              131            244
4          E             40          138               94            299
5          F             22          351               24            317

In [25]:
df.sum()

Department         ABCDEF
Male-Admitted        1126
Male-Denied          1493
Female-Admitted       557
Female-Denied        1278
dtype: object

In [28]:
1126 / (1126 + 1493)

0.42993508972890415

In [29]:
557 / (557 + 1278)

0.30354223433242505

In [33]:
df.sum()

Department         ABCDEF
Male-Admitted        1126
Male-Denied          1493
Female-Admitted       557
Female-Denied        1278
dtype: object

In [27]:
pd.DataFrame(df.sum()).T

  Department Male-Admitted Male-Denied Female-Admitted Female-Denied
0     ABCDEF          1126        1493             557          1278

In [31]:
type(df.sum())

pandas.core.series.Series

In [35]:
df_university = pd.DataFrame(df.sum()).T

In [36]:
df_university

  Department Male-Admitted Male-Denied Female-Admitted Female-Denied
0     ABCDEF          1126        1493             557          1278

In [37]:
df

  Department  Male-Admitted  Male-Denied  Female-Admitted  Female-Denied
0          A            512          313               89             19
1          B            313          207               17              8
2          C            101          205              202            391
3          D            138          279              131            244
4          E             40          138               94            299
5          F             22          351               24            317

In [39]:
df_overall = pd.concat([df, df_university])

In [40]:
df_overall

  Department Male-Admitted Male-Denied Female-Admitted Female-Denied
0          A           512         313              89            19
1          B           313         207              17             8
2          C           101         205             202           391
3          D           138         279             131           244
4          E            40         138              94           299
5          F            22         351              24           317
0     ABCDEF          1126        1493             557          1278

In [41]:
df = df_overall
df['Female-Ratio'] = df['Female-Admitted'] / (df['Female-Admitted'] + df['Female-Denied'])
df['Male-Ratio'] = df['Male-Admitted'] / (df['Male-Admitted'] + df['Male-Denied'])

In [42]:
df

,Department,Male-Admitted,Male-Denied,Female-Admitted,Female-Denied,Female-Ratio,Male-Ratio
0,A,512,313,89,19,0.824074,0.620606
1,B,313,207,17,8,0.68,0.601923
2,C,101,205,202,391,0.340641,0.330065
3,D,138,279,131,244,0.349333,0.330935
4,E,40,138,94,299,0.239186,0.224719
5,F,22,351,24,317,0.0703812,0.0589812
0,ABCDEF,1126,1493,557,1278,0.303542,0.429935

In [44]:
df['Favour-Female'] = df['Female-Ratio'] > df['Male-Ratio']

In [45]:
df

,Department,Male-Admitted,Male-Denied,Female-Admitted,Female-Denied,Female-Ratio,Male-Ratio,Favour-Female
0,A,512,313,89,19,0.824074,0.620606,True
1,B,313,207,17,8,0.68,0.601923,True
2,C,101,205,202,391,0.340641,0.330065,True
3,D,138,279,131,244,0.349333,0.330935,True
4,E,40,138,94,299,0.239186,0.224719,True
5,F,22,351,24,317,0.0703812,0.0589812,True
0,ABCDEF,1126,1493,557,1278,0.303542,0.429935,False